'''
Напишите программу, которая спрашивает имя пользователя и затем приветствует его
'''

# print("Enter your name: ")
# name = input()
# print('Hello,', name)

'''
Напишите программу, которая считывает три числа и выводит их сумму.
'''
a = int(input("Enter first number: "))
b = int(input("Enter second number: "))
c = int(input("Enter third number: "))
print(a + b + c)

